[
    {
        "grammarPoint": "～場合は (Trong trường hợp)",
        "examples": [
            {
                "sentence": "火事の場合は、逃げてください。",
                "translation": "Trong trường hợp hỏa hoạn, hãy chạy thoát thân.",
                "translationEn": "In case of fire, please run away."
            },
            {
                "sentence": "会議に間に合わない場合は、連絡してください。",
                "translation": "Trong trường hợp không kịp họp, hãy liên lạc.",
                "translationEn": "Please contact us if you will not be in time for the meeting."
            },
            {
                "sentence": "パスポートをなくした場合は、大使館へ行きます。",
                "translation": "Trong trường hợp mất hộ chiếu, hãy đến đại sứ quán.",
                "translationEn": "If you lose your passport, go to the embassy."
            },
            {
                "sentence": "雨の場合は、中止です。",
                "translation": "Trong trường hợp trời mưa, sẽ bị hủy.",
                "translationEn": "In case of rain, it will be cancelled."
            },
            {
                "sentence": "故障の場合は、修理を呼びます。",
                "translation": "Trong trường hợp hỏng hóc, tôi sẽ gọi thợ sửa.",
                "translationEn": "In case of failure, I call for repairs."
            },
            {
                "sentence": "カードをなくした場合は、どうしたらいいですか。",
                "translation": "Trong trường hợp mất thẻ thì tôi nên làm thế nào?",
                "translationEn": "What should I do if I lose my card?"
            },
            {
                "sentence": "熱が下がらない場合は、薬を飲んでください。",
                "translation": "Trong trường hợp không hạ sốt, hãy uống thuốc.",
                "translationEn": "If the fever does not go down, please take medicine."
            },
            {
                "sentence": "領収書が必要な場合は、言ってください。",
                "translation": "Trong trường hợp cần hóa đơn, hãy nói nhé.",
                "translationEn": "If you need a receipt, please say so."
            },
            {
                "sentence": "キャンセルの場合は、電話してください。",
                "translation": "Trong trường hợp hủy bỏ, hãy gọi điện.",
                "translationEn": "In case of cancellation, please call."
            },
            {
                "sentence": "地震の場合は、机の下に入ってください。",
                "translation": "Trong trường hợp động đất, hãy chui xuống gầm bàn.",
                "translationEn": "In case of an earthquake, please get under the desk."
            }
        ]
    },
    {
        "grammarPoint": "～のに (Mặc dù)",
        "examples": [
            {
                "sentence": "約束をしたのに、彼女は来ませんでした。",
                "translation": "Mặc dù đã hẹn rồi thế mà cô ấy không đến.",
                "translationEn": "Even though we made a promise, she didn't come."
            },
            {
                "sentence": "今日は日曜日なのに、働かなければなりません。",
                "translation": "Hôm nay là chủ nhật thế mà tôi vẫn phải làm việc.",
                "translationEn": "Even though today is Sunday, I have to work."
            },
            {
                "sentence": "薬を飲んだのに、熱が下がりません。",
                "translation": "Mặc dù đã uống thuốc nhưng vẫn không hạ sốt.",
                "translationEn": "Even though I took medicine, my fever doesn't go down."
            },
            {
                "sentence": "一生懸命勉強したのに、不合格でした。",
                "translation": "Mặc dù đã học chăm chỉ nhưng vẫn trượt.",
                "translationEn": "Even though I studied hard, I failed."
            },
            {
                "sentence": "安かったのに、買いませんでした。",
                "translation": "Mặc dù rẻ nhưng tôi đã không mua.",
                "translationEn": "Even though it was cheap, I didn't buy it."
            },
            {
                "sentence": "お金がないのに、高い時計を買いました。",
                "translation": "Mặc dù không có tiền nhưng lại mua đồng hồ đắt tiền.",
                "translationEn": "Even though I have no money, I bought an expensive watch."
            },
            {
                "sentence": "元気なのに、仕事をしません。",
                "translation": "Mặc dù khỏe mạnh nhưng lại không chịu làm việc.",
                "translationEn": "Even though he is healthy, he doesn't work."
            },
            {
                "sentence": "3月なのに、まだ寒いです。",
                "translation": "Mặc dù là tháng 3 rồi nhưng vẫn lạnh.",
                "translationEn": "Even though it is March, it is still cold."
            },
            {
                "sentence": "彼は有名な医師なのに、謙虚です。",
                "translation": "Mặc dù là bác sĩ nổi tiếng nhưng ông ấy rất khiêm tốn (trường hợp này là khen ngợi/ngạc nhiên tích cực).",
                "translationEn": "Even though he is a famous doctor, he is humble."
            },
            {
                "sentence": "もう12時なのに、まだ寝ません。",
                "translation": "Đã 12 giờ rồi mà vẫn chưa ngủ.",
                "translationEn": "Even though it's already 12, he won't sleep."
            }
        ]
    }
]