[
    {
        "grammarPoint": "Thể Điều kiện (Ba)",
        "examples": [
            {
                "sentence": "安ければ、買います。",
                "translation": "Nếu rẻ thì tôi sẽ mua.",
                "translationEn": "If it is cheap, I will buy it."
            },
            {
                "sentence": "春になれば、桜が咲きます。",
                "translation": "Nếu trời sang xuân, hoa anh đào sẽ nở.",
                "translationEn": "If spring comes, cherry blossoms will bloom."
            },
            {
                "sentence": "天気がよければ、向こうに島が見えます。",
                "translation": "Nếu thời tiết tốt, có thể nhìn thấy đảo ở phía kia.",
                "translationEn": "If the weather is good, you can see the island over there."
            },
            {
                "sentence": "意見があれば、言ってください。",
                "translation": "Nếu có ý kiến thì hãy nói đi.",
                "translationEn": "If you have an opinion, please speak up."
            },
            {
                "sentence": "明日暇なら、遊びに行きませんか。",
                "translation": "Nếu mai rảnh thì đi chơi không?",
                "translationEn": "If you are free tomorrow, shall we go hang out?"
            },
            {
                "sentence": "この薬を飲めば、元気になります。",
                "translation": "Nếu uống thuốc này sẽ khỏe lại.",
                "translationEn": "If you take this medicine, you will get well."
            },
            {
                "sentence": "バスが来なければ、タクシーで行きます。",
                "translation": "Nếu xe buýt không đến, tôi sẽ đi bằng taxi.",
                "translationEn": "If the bus doesn't come, I'll go by taxi."
            },
            {
                "sentence": "日本語がわからなければ、英語で話してもいいです。",
                "translation": "Nếu không hiểu tiếng Nhật, nói tiếng Anh cũng được.",
                "translationEn": "If you don't understand Japanese, you can speak English."
            },
            {
                "sentence": "急げば、間に合います。",
                "translation": "Nếu vội (nhanh lên) thì sẽ kịp.",
                "translationEn": "If you hurry, you will make it."
            },
            {
                "sentence": "説明書を読めば、使い方がわかります。",
                "translation": "Nếu đọc sách hướng dẫn thì sẽ hiểu cách dùng.",
                "translationEn": "If you read the manual, you will understand how to use it."
            }
        ]
    },
    {
        "grammarPoint": "N なら (Nếu là)",
        "examples": [
            {
                "sentence": "温泉なら、白馬がいいですよ。",
                "translation": "Nếu là suối nước nóng thì Hakuba được đấy.",
                "translationEn": "If you are talking about Onsen, Hakuba is good."
            },
            {
                "sentence": "東京へ行くなら、新幹線が便利です。",
                "translation": "Nếu đi Tokyo thì Shinkansen tiện lợi.",
                "translationEn": "If you go to Tokyo, Shinkansen is convenient."
            },
            {
                "sentence": "カメラなら、秋葉原が安いです。",
                "translation": "Nếu là máy ảnh thì Akihabara rẻ lắm.",
                "translationEn": "If you are looking for a camera, Akihabara is cheap."
            },
            {
                "sentence": "日本料理なら、天ぷらがおいしいです。",
                "translation": "Nếu là món Nhật thì Tempura ngon.",
                "translationEn": "If it's Japanese food, Tempura is delicious."
            },
            {
                "sentence": "お土産なら、人形がいいでしょう。",
                "translation": "Nếu là quà lưu niệm thì búp bê chắc là được đấy.",
                "translationEn": "If it's a souvenir, a doll would be good."
            },
            {
                "sentence": "パソコンを買うなら、あの店がいいです。",
                "translation": "Nếu mua máy tính thì cửa hàng kia tốt.",
                "translationEn": "If you buy a computer, that shop is good."
            },
            {
                "sentence": "旅行なら、北海道が一番です。",
                "translation": "Nếu là du lịch thì Hokkaido là nhất.",
                "translationEn": "If it's travel, Hokkaido is the best."
            },
            {
                "sentence": "古いお寺なら、京都にたくさんあります。",
                "translation": "Nếu là chùa cổ thì Kyoto có nhiều lắm.",
                "translationEn": "If it's old temples, there are many in Kyoto."
            },
            {
                "sentence": "スキーなら、ニセコが有名です。",
                "translation": "Nếu là trượt tuyết thì Niseko nổi tiếng.",
                "translationEn": "If it's skiing, Niseko is famous."
            },
            {
                "sentence": "借りるなら、図書館がいいです。",
                "translation": "Nếu mượn (sách) thì thư viện là tốt nhất.",
                "translationEn": "If you borrow, the library is good."
            }
        ]
    }
]