[
    {
        "grammarPoint": "～て、～ (Nguyên nhân)",
        "examples": [
            {
                "sentence": "ニュースを聞いて、びっくりしました。",
                "translation": "Nghe tin tức xong, tôi giật mình (Vì nghe tin nên giật mình).",
                "translationEn": "I was surprised to hear the news."
            },
            {
                "sentence": "家族に会えなくて、寂しいです。",
                "translation": "Vì không gặp được gia đình nên tôi buồn.",
                "translationEn": "I feel lonely because I can't see my family."
            },
            {
                "sentence": "歯が痛くて、食べられません。",
                "translation": "Vì đau răng nên tôi không ăn được.",
                "translationEn": "I can't eat because I have a toothache."
            },
            {
                "sentence": "今日は日曜日で、学校は休みです。",
                "translation": "Hôm nay là chủ nhật nên trường nghỉ.",
                "translationEn": "Today is Sunday, so school is closed."
            },
            {
                "sentence": "説明が複雑で、よくわかりませんでした。",
                "translation": "Vì giải thích phức tạp nên tôi không hiểu rõ lắm.",
                "translationEn": "The explanation was complicated, so I didn't understand it well."
            },
            {
                "sentence": "遅れて、すみません。",
                "translation": "Xin lỗi vì tôi đến muộn.",
                "translationEn": "I'm sorry for being late."
            },
            {
                "sentence": "お金がなくて、買えません。",
                "translation": "Vì không có tiền nên tôi không mua được.",
                "translationEn": "I don't have money, so I can't buy it."
            },
            {
                "sentence": "電話がなくて、不便です。",
                "translation": "Không có điện thoại nên bất tiện.",
                "translationEn": "It's inconvenient not to have a phone."
            },
            {
                "sentence": "暑くて、寝られませんでした。",
                "translation": "Vì nóng nên tôi không ngủ được.",
                "translationEn": "It was hot, so I couldn't sleep."
            },
            {
                "sentence": "事故があって、バスが遅れました。",
                "translation": "Vì có tai nạn nên xe buýt đến muộn.",
                "translationEn": "There was an accident, so the bus was late."
            }
        ]
    },
    {
        "grammarPoint": "～ので、～ (Nguyên nhân khách quan)",
        "examples": [
            {
                "sentence": "用事があるので、お先に失礼します。",
                "translation": "Vì có việc bận nên tôi xin phép về trước.",
                "translationEn": "I have something to do, so I will be leaving now."
            },
            {
                "sentence": "気分が悪いので、帰ってもいいですか。",
                "translation": "Vì tôi thấy không khỏe nên tôi về có được không?",
                "translationEn": "I'm not feeling well, so may I go home?"
            },
            {
                "sentence": "日本人の友達が欲しいので、日本語を勉強しています。",
                "translation": "Vì muốn có bạn người Nhật nên tôi học tiếng Nhật.",
                "translationEn": "I want Japanese friends, so I am studying Japanese."
            },
            {
                "sentence": "バスが来ないので、タクシーで行きましょう。",
                "translation": "Vì xe buýt không đến nên chúng ta đi taxi đi.",
                "translationEn": "The bus isn't coming, so let's take a taxi."
            },
            {
                "sentence": "危ないので、触らないでください。",
                "translation": "Vì nguy hiểm nên đừng chạm vào.",
                "translationEn": "It is dangerous, so please do not touch it."
            },
            {
                "sentence": "雨なので、試合は中止です。",
                "translation": "Vì trời mưa nên trận đấu bị hủy.",
                "translationEn": "Since it is raining, the match is cancelled."
            },
            {
                "sentence": "荷物が多いので、手伝っていただけませんか。",
                "translation": "Vì hành lý nhiều nên bạn giúp tôi được không?",
                "translationEn": "I have a lot of luggage, so could you help me please?"
            },
            {
                "sentence": "日本語がわからないので、英語で話してください。",
                "translation": "Vì tôi không hiểu tiếng Nhật nên hãy nói tiếng Anh.",
                "translationEn": "I don't understand Japanese, so please speak English."
            },
            {
                "sentence": "約束があるので、早く帰らなければなりません。",
                "translation": "Vì có hẹn nên tôi phải về sớm.",
                "translationEn": "I have an appointment, so I have to go home early."
            },
            {
                "sentence": "このパソコンは古いので、遅いです。",
                "translation": "Vì máy tính này cũ nên nó chậm.",
                "translationEn": "This computer is old, so it is slow."
            }
        ]
    }
]